src/InformationRegisters/ШтрихкодыИнвентаризацииОбуви/ШтрихкодыИнвентаризацииОбуви.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыИнвентаризацииОбуви</name>
  <comment>Используется вместо табличной части документа ИнвентаризацияСклад, чтобы не пропадали данные при работе в автономном режиме.</comment>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Комплектовщик</name>
    <type>
      <types>CatalogRef.Комплектовщики</types>
    </type>
  </resources>
  <resources>
    <name>НомерЯчейки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ИнвентаризацияСклад</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>31</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ШтрихкодыИнвентаризацииОбуви/ManagerModule.bsl
// @strict-types
#Область ПрограммныйИнтерфейс

// Процедура добавляет запись о штрихкоде.
// 
// Параметры:
//  ИнвентаризацияСклад - ДокументСсылка.ИнвентаризацияСклад
//  Комплектовщик - СправочникСсылка.Комплектовщики
//  НомерЯчейки - Строка
//  Штрихкод - Строка
//  Время - Дата
Процедура ДобавитьШтрихкод(Знач ИнвентаризацияСклад, Знач Комплектовщик, Знач НомерЯчейки, Знач Штрихкод, Знач Время) Экспорт

    Запись = СоздатьМенеджерЗаписи();

    Запись.Документ = ИнвентаризацияСклад;
    Запись.Штрихкод = Штрихкод;
    Запись.Комплектовщик = Комплектовщик;
    Запись.НомерЯчейки = НомерЯчейки;
    Запись.Дата = Время;

    Запись.Записать();

КонецПроцедуры

// Процедура удаляет запись о штрихкоде.
// 
// Параметры:
//  ИнвентаризацияСклад - ДокументСсылка.ИнвентаризацияСклад
//  Штрихкод - Строка
Процедура УдалитьШтрихкод(Знач ИнвентаризацияСклад, Знач Штрихкод) Экспорт

    Запись = СоздатьМенеджерЗаписи();

    Запись.Документ = ИнвентаризацияСклад;
    Запись.Штрихкод = Штрихкод;

    Запись.Удалить();

КонецПроцедуры

// Процедура удаляет записи о штрихкодах комплектовщика.
// 
// Параметры:
//  ИнвентаризацияСклад - ДокументСсылка.ИнвентаризацияСклад - 
//  Комплектовщик - СправочникСсылка.Комплектовщики - 
// 
// Возвращаемое значение:
//  Число - Количество удаленных штрихкодов
Функция УдалитьШтрихкодыКомплектовщика(Знач ИнвентаризацияСклад, Знач Комплектовщик) Экспорт

    НачатьТранзакцию();

    Попытка

        КоличествоУдаленныхШтрихкодов = 0;
    
        // 1. Поиск всех штрихкодов комплектовщика
        Запрос = Новый Запрос("ВЫБРАТЬ
                              |    ВсеШтрихкоды.Штрихкод КАК Штрихкод
                              |ИЗ
                              |    РегистрСведений.ШтрихкодыИнвентаризацииОбуви КАК ВсеШтрихкоды
                              |ГДЕ
                              |    ВсеШтрихкоды.Документ = &Документ
                              |    И ВсеШтрихкоды.Комплектовщик = &Комплектовщик");

        Запрос.УстановитьПараметр("Комплектовщик", Комплектовщик);
        Запрос.УстановитьПараметр("Документ", ИнвентаризацияСклад);
        РезультатЗапроса = Запрос.Выполнить();
        Выборка = РезультатЗапроса.Выбрать();

        // 2. Удаление штрихкодов по одному
        Пока Выборка.Следующий() Цикл
            
            //@skip-check property-return-type
            Штрихкод = Выборка.Штрихкод; // Строка

            Запись = СоздатьМенеджерЗаписи();

            Запись.Документ = ИнвентаризацияСклад;
            Запись.Комплектовщик = Комплектовщик;
            Запись.Штрихкод = Штрихкод;

            Запись.Удалить();

            КоличествоУдаленныхШтрихкодов = КоличествоУдаленныхШтрихкодов + 1;

        КонецЦикла;

        ЗафиксироватьТранзакцию();

        Возврат КоличествоУдаленныхШтрихкодов;

    Исключение

        ОтменитьТранзакцию();
        ВызватьИсключение;

    КонецПопытки;

КонецФункции

#КонецОбласти
